Cases/sCO2Channel-RANS_1.03_500_20_coarsestConstProp/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  7.638344E6; 

boundaryField
{
    BotWall1
    {
	    	type			zeroGradient;
    }
    BotWall2
    {
	    	type			zeroGradient;
    }
    OtherWalls
    {
	    	type			zeroGradient;
    }

    Inlet
    {
        type               fixedValue;
        value              uniform 7.63883E6;
    }
    Outlet
    {
        type               fixedValue;
        value              uniform 7.638344E6;
    }
}

// ************************************************************************* //
